Repository: varialus/DragonFlyDebian
Catalog: freebsd-utils/debian/po/*.po
Languages: de, es, gl, sv

source: Keymap:
de: Tastenbelegung:
es: Distribución del teclado:
gl: Mapa de teclado:
sv: Tangentbordsupplägg:

source: Please choose the keyboard map.
de: Bitte wählen Sie die Tastenbelegung.
es: Escoja la distribución del teclado.
gl: Escolla o mapa de teclado.
sv: Ange tangentbordsupplägg:

source: If in doubt, don't choose any map. You can always come back to this question with "dpkg-reconfigure kbdcontrol".
de: Falls Sie sich nicht sicher sind, wählen Sie keine Tastenbelegung. Sie können jederzeit mit dem Befehl »dpkg-reconfigure kbdcontrol« zu dieser Frage zurückkehren.
es: Si duda, no escoja ninguna distribución. Siempre puede volver a esta pregunta ejecutando «dpkg-reconfigure kdbcontrol».
gl: Se ten dúbidas, non escolla mapa ningún. Sempre poderá volver a esta pregunta con «dpkg-reconfigure kdbcontrol».
sv: Om du är osäker ska du inte ange något särskilt tangetbordsupplägg. Du kan alltid återkommer till denna fråga genom att köra "dpkg-reconfigure kbdcontrol".

source: Network card drivers:
de: Treiber für Netzwerkkarten:
es: Controladores de la tarjeta de red:
gl: Controladores da tarxeta de rede:
sv: Drivrutiner för nätverkskort:

source: Please select drivers for this machine's network card(s). You may select more than one driver, or none at all, depending on the number of cards installed in the machine.
de: Bitte wählen Sie die/den Treiber der Netzwerkkarte(n) dieses Systems. Sie können mehrere Treiber oder gar keinen auswählen, abhängig davon, welche Karten in diesem System installiert sind.
es: Escoja los controladores para la/s tarjeta/s de red de esta máquina. Puede escoger más de un controlador, o ninguno, dependiendo del número de tarjetas instaladas en la máquina.
gl: Escolla os controladores das tarxetas de rede desta máquina. Pode escoller ningún, un ou máis, dependendo da cantidade de tarxetas que teña instaladas na máquina.
sv: Ange drivrutiner för maskinens nätverkskort. Du kan välja mer än en drivrutin, eller ingen alls, beroende på antalet nätverkskort som finns installerade i maskinen.

source: You most likely don't need any, since default kernels currently include built-in support for network cards. You can always come back to this question later.
de: Sehr wahrscheinlich benötigen Sie gar keinen, da die Standard-Kernel momentan Unterstützung für Netzwerkkarten beinhalten. Sie können jederzeit zu dieser Frage zurückkehren.
es: Seguramente no necesite ninguno, ya que, actualmente, los núcleos predeterminados incluyen compatibilidad con las tarjetas de red. Siempre puede volver a esta pregunta más tarde.
gl: Posibelmente non precise ningunha, porque os núcleos por omisión levan incorporado o soporte para tarxetas de rede. Sempre poderá volver a esta pregunta máis tarde.
sv: I de allra flesta fall behöver du inte ange några alls eftersom kärnan har inbyggt stöd för nätverkskort. Du kan alltid återvända till den här frågan senare.

source: Sound card drivers:
de: Treiber für Soundkarten:
es: Controladores de la tarjeta de sonido:
gl: Controladores da tarxeta de son:
sv: Drivrutin för ljudkort:

source: Please select drivers for this machine's sound card(s). You may select more than one driver, or none at all, depending on the number of cards installed in the machine.
de: Bitte wählen Sie die/den Treiber der Soundkarte(n) dieses Systems. Sie können mehrere Treiber oder gar keinen auswählen, abhängig davon, welche Karten in diesem System installiert sind.
es: Escoja los controladores para la/s tarjeta/s de sonido de esta máquina. Puede escoger más de un controlador, o ninguno, dependiendo del número de tarjetas instaladas en la máquina.
gl: Escolla os controladores das tarxetas de son desta máquina. Pode escoller ningún, un ou máis, dependendo da cantidade de tarxetas que teña instaladas na máquina.
sv: Ange drivrutiner för maskinens ljudkort. Du kan välja mer än en drivrutin, eller ingen alls, beroende på antalet ljudkort som finns installerade i maskinen.

source: If in doubt, leave this field empty. The "snd_probe" command may be used later to identify the sound card(s). You can always come back to this question with "dpkg-reconfigure kldutils".
de: Falls Sie sich nicht sicher sind, lassen Sie dieses Feld leer. Das Befehl »snd_probe« kann später zur Identifikation der Soundkarte(n) benutzt werden. Sie können jederzeit mit dem Befehl »dpkg-reconfigure kldutils« zu dieser Frage zurückkehren.
es: Si duda, deje este campo en blanco. Más tarde puede utilizar la orden «snd_probe» para identificar la/s tarjeta/s de sonido. Siempre puede volver a esta pregunta ejecutando «dpkg-reconfigure kldutils».
gl: Se ten dúbidas, deixe este campo en branco. Pode empregar a orde «snd_probe» para identificar as tarxetas de son. Sempre poderá volver máis tarde a esta pregunta con «dpkg-reconfigure kldutils».
sv: Om du är osäker kan du lämna fältet tomt. Kommandot "snd_probe" kan sedan användas för att hitta ditt/dina ljudkort. Du kan alltid återvända till den här frågan genom att köra "dpkg-reconfigure kldutils".

source: Other modules:
de: Weitere Module:
es: Otros módulos:
gl: Outros módulos:
sv: Andra moduler:

source: Please select the modules needed to properly support this machine's hardware.
de: Bitte wählen Sie die Module, die benötigt werden, damit die Hardware dieses Systems ausreichend unterstützt wird.
es: Escoja los módulos necesarios para poder utilizar los dispositivos de esta máquina.
gl: Escola os módulos precisos para soportar adecuadamente o hardware desta máquina.
sv: Ange de moduler som behövs för att kunna använda maskinens hårdvara korrekt.

source: If in doubt, leave this field empty. You can always come back to this question with "dpkg-reconfigure kldutils".
de: Falls Sie sich nicht sicher sind, lassen Sie dieses Feld leer. Sie können jederzeit mit dem Befehl »dpkg-reconfigure kldutils« zu dieser Frage zurückkehren.
es: Si duda, deje este campo en blanco. Siempre puede volver a esta pregunta ejecutando «dpkg-reconfigure kldutils».
gl: Se ten dúbidas deixe o campo en branco. Pode volver máis tarde a esta pregunta con «dpkg-reconfigure kldutils».
sv: Om du är osäker kan detta fält lämnas tomt. Du kan alltid återvända till denna fråga med kommandot "dpkg-reconfigure kldutils".
